{
    "0": "## ACME Screw Tailstock - Troubleshooting Guide\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 1/8\n\n\n-----\n\n",
    "1": "LAST UPDATED: 11/07/2024\n\n\n# ACME Screw Tailstock - Troubleshooting Guide\n\n\n# Overview\n\n Symptom Table\n\n\n1. ACME Screw cover\n2. Tailstock Body\n3. Tailstock Grease Reservoir\n\n\n![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-1-0.png)\n\n1. ACME SCREW 1.25-5-47\"-.625 R-ANC\n2. ACME SCREW NUT 1.25-5 X 2.5\n3. Ballscrew Bumper\n4. Tailstock motor cover\n5. Tailstock Hydraulic Motor\n6. ACME SCREW Bearing Housing Anchor\n\n\n![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-1-0.png)\n\n1. Coupling Jaw Type\n2. Proximity Sensors\n3. Microswitch Trip Flag\n4. Microswitch (Home Sensor)\n5. Microswitch Mount\n6. Proximity Sensor Trip Flag\n7. Hydraulic Tailstock Motor\n\n\n![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-1-0.png)\n\n###  NOTE: This system is louder than other tailstock systems, due to the use of a hydraulic\n\nmotor. This is normal operation and should not be disassembled for troubleshooting unless it is not\npositioning correctly.\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 2/8\n\n\n-----\n\n",
    "2": "|SYMPTOM|POSSIBLE CAUSE|CORRECTIVE ACTION|\n|---|---|---|\n|Excessive Noise from the tailstock Mispositioning and backlash Binding Low hold force|The ACME Screw and ACME Nut are not lubricated.|Clean and lubricate the ACME Screw and ACME Nut.|\n||The ACME Screw or ACME Nut are contaminated from chips.|Clean the ACME Screw and ACME Nut and check for damage and wear. Lubricate the screw after cleaning. Install the B-Axis Protection Service Kit. Refer to the Lathe - B-Axis - Protection Service Kit - Installation procedure. If the Protection Kit was installed before the ACME Screw Wipers were included in the kit. Install 57-0939 to either side of the ACME Nut. Refer to the ACME Screw Wiper Installation section below.|\n||Tailstock is jammed against a part.|Remove tailstock ACME Screw front cap and turn the ACME Screw to unjam it. Reduce tailstock hydraulic pressure to 250 psi. There is no need to loosen the hydraulic hoses.|\n||The ACME screw nut may have failed.|Inspect the ACME Screw Nut for damaged threads. Replace the ACME screw nut if damaged. Note: Before installing, clean the ACME screw and grease before reassembly. Install the B-Axis Protection Service Kit. Refer to the Lathe - B-Axis - Protection Service Kit - Installation procedure. If the Protection Kit was installed before the ACME Screw Wipers were included in the kit. Install 57-0939 to either side of the ACME Nut. Refer to the ACME Screw Wiper Installation section below.|\n||ACME Screw Misalignment|Check the ACME Screw Alignment. Refer to the ACME Screw Alignment section below.|\n||ACME Screw Nut Housing part geometry|Check the ACME Screw Alignment. Refer to the ACME Screw Alignment section below.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 3/8\n\n\n-----\n\n",
    "3": "|The tailstock zero returns in the wrong direction. Or the Tailstock mispositions.|The tailstock home sensor or trip flag has been damaged from chips.|Clean the ACME Screw and ACME Nut and check for damage and wear. Grease the screw after cleaning. Inspect the tailstock home sensor and trip flag. If the trip flag has been failing due to chip build-up install service kit P/N: 93-3393 tailstock home switch retrofit kit. Refer to the Tailstock Home Switch Retrofit - Installation procedure. Only applies to ST- 20/25/28 machines built with 20-7462E BASE ST-20 MACH from 07/08/2021 to 09/16/2021 and ST-30/35 machines built with 20-7625D BASE ST-30 MACH from 12/01/2020 to 08/17/2021. Install the B-Axis Protection Service Kit. Refer to the Lathe - B-Axis - Protection Service Kit - Installation procedure. If the Protection Kit was installed before the ACME Screw Wipers were included in the kit. Install 57-0939 to either side of the ACME Nut. Refer to the ACME Screw Wiper Installation section below.|\n|---|---|---|\n|The Tailstock pressure does not adjust.|The Programmable Pressure Motor does not turn.|Check electrical connections to the pressure switch or motor or for failed hardware such as the pressure valve, hydraulic motor, or coupler. Follow the Programmable Pressure Adjustment Valve - Troubleshooting Guide.|\n|Alarm 9505 or 9505.001 COMMANDED PRESSURE NOT REACHED.|The commanded device pressure was not reached within the specified timeout.|Check electrical connections to the pressure switch or motor or for failed hardware such as the pressure valve, hydraulic motor, or coupler. Follow the Programmable Pressure Adjustment Valve - Troubleshooting Guide.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 4/8\n\n\n-----\n\n",
    "4": "|Alarm 437 TAILSTOCK UNDERSHOOT|The tailstock did not reach the commanded position. The encoder data isn’t being read during a zero return.|Clean the ACME Screw and ACME Nut and check for damage and wear. Grease the screw after cleaning. Check the proximity switches and encoder switch trip flag are not obstructed or misaligned from chip build up. Verify the proximity sensors are working correctly. Follow the Proximity Sensor - Troubleshooting Guide. Inspect the tailstock encoder assembly and trip flag. If the encoder is failing due to chip build-up, then clean the encoder area from any debris. For ST-20/30 Series Machines, new encoder brackets will need to be ordered to fix any chip build-up. Refer to: HSG-N 05-29-2024. Check that the values of Setting 341 and 342 (on the user position tab) are correct for the part Check that the part is seated correctly in the chuck. Check that the tailstock was not blocked by the tool turret or another solid object in the machine. For a hydraulic tailstock, check that tailstock hydraulic pressure is not too low. Check the solenoids are operating correctly. Check the ACME Screw Alignment section below. Inspect the tailstock home sensor and trip flag. If the trip flag has been failing due to chip build-up install service kit P/N: 93- 3393 tailstock home switch retrofit kit. Refer to the Tailstock Home Switch Retrofit - Installation procedure. Only applies to ST- 20/25/28 machines built with 20-7462E BASE ST-20 MACH from 07/08/2021 to 09/16/2021 and ST-30/35 machines built with 20-7625D BASE ST-30 MACH from 12/01/2020 to 08/17/2021.|\n|---|---|---|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 5/8\n\n\n-----\n\n",
    "5": "|Alarm 6.9107 B (TAILSTOCK) CHECK YOUR HOME SWITCH|The tailstock did not reach the commanded position because encoder data isn’t being read during a zero return.|Note: For software versions 100.23.000.1000 and later, alarm 437 TAILSTOCK UNDERSHOOT will generate in the event encoder data isn’t being read during a zero return. Clean the ACME Screw and ACME Nut and check for damage and wear. Grease the screw after cleaning. Check the proximity switches and encoder switch trip flag are not obstructed or misaligned from chip build up. Verify the proximity sensors are working correctly. Follow the Proximity Sensor - Troubleshooting Guide. Inspect the tailstock encoder assembly and trip flag. If the encoder is failing due to chip build-up install the B-Axis Protection Service Kit. Refer to the Lathe - B-Axis - Protection Service Kit - Installation procedure. If the Protection Kit was installed before the ACME Screw Wipers were included in the kit. Install 57-0939 to either side of the ACME Nut. Refer to the ACME Screw Wiper Installation section below.|\n|---|---|---|\n||Home switch not transitioning off/on the home position.|Clean the ACME Screw and ACME Nut and check for damage and wear. Grease the screw after cleaning. Check the home switch trip flag to make sure it is not obstructed or misaligned. Inspect the tailstock home sensor and trip flag. If the trip flag has been failing due to chip build-up install service kit P/N: 93-3393 tailstock home switch retrofit kit. Refer to the Tailstock Home Switch Retrofit - Installation procedure. Only applies to ST-20/25/28 machines built with 20-7462E BASE ST-20 MACH from 07/08/2021 to 09/16/2021 and ST- 30/35 machines built with 20-7625D BASE ST- 30 MACH from 12/01/2020 to 08/17/2021. Install the B-Axis Protection Service Kit. Refer to the Lathe - B-Axis - Protection Service Kit - Installation procedure. If the Protection Kit was installed before the ACME Screw Wipers were included in the kit. Install 57-0939 to either side of the ACME Nut. Refer to the ACME Screw Wiper Installation below.|\n|Motor coupler cracks.|When reinstalling the coupler the M6 screws are over torqued.|Torque the coupler hardware to the correct torque specification 10 ft-lbs.|\n|Tailstock gets stuck on the part and it will not retract when the tailstock is engaged at full hydraulic pressure.|Tailstock settings may not be set correctly.|Verify that settings 105 - TailStock Retract Distance, 341 - Tailstock Rapid Position, and 342 - Tailstock Advance Distance are correct.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 6/8\n\n\n-----\n\n",
    "6": "# ACME Screw Alignment\n\n## 1\n\nDisconnect the Hydraulic Motor Hoses. Using\na collar nut tool and a drill, drive the riser\nassembly to the motor side of the screw.\nLoosen all the bolts below and make them\nfinger tight:\n\nACME Nut to ACME Nut Housing[1]\nMotor Mount[2]\nMotor Coupler Pinch Bolts[3]\nMotor Bolts[4]\n\nTorque the bolts in the following order:\n\nACME Nut to ACME Nut Housing[1]\n\nUsing a collar nut tool and a drive. Run the\nACME screw back and forth +/- 2 inches.\n\nMotor Mount[2]\nMotor Coupler Pinch Bolts[3] (10 ft-lbs)\n\nUsing a collar nut tool and a drive. Run the\nACME screw back and forth +/- 2 inches\n\nMotor Bolts[4]\n\n## 2\n\nReconnect the Hydraulic Motor Hoses.\n\nUse the hand torque meter to test the\nbreakaway torque of the B-Axis at the start\nmiddle and end of travel. NTE 15 in-lbs.\n\nIf the torque exceeds 15 in-lbs. Continue the\nACME Screw alignment.\n\n## 3\n\nRemove the Grease Reservoir if installed.\nRemove the tailstock quill assembly to install a\nsling through the bore. Remove the tailstock\ncasting to access the ACME Screw Housing\nhardware.\n\nDisconnect the Hydraulic Motor Hoses. Using\na collar nut tool and a drill, drive the riser\nassembly to the motor side of the screw.\nLoosen all the bolts below and make them\nfinger tight:\n\nACME Nut Housing to Tailstock Riser[1]\nACME Nut to ACME Nut Housing[2]\nMotor Mount[3]\nMotor Coupler Pinch Bolts[4]\nMotor Bolts[5]\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 7/8\n\n\n![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-6-0.png)\n\n![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-6-1.png)\n\n-----\n\n",
    "7": "![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-7-0.png)\n\n# ACME Screw Wiper Installation\n\n\nInstall the each wiper so that the side with the\nshoulder[1] faces the ACME Nut.\n\nInstall the motor side wiper[2] against the\nACME Nut with the ACME Nut grease fitting in\nthe middle of the slot.\n\nInstall the support side wiper[3] against the\nACME Nut with the slot facing down.\n\n\n![](photo/ACME Screw Tailstock - Troubleshooting Guide.pdf/ACME-Screw-Tailstock---Troubleshooting-Guide.pdf-7-0.png)\n\nThe following service video shows a tailstock\nhydrualic motor axis movement noise for\nreference.\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/acme-screw-tailstock----troubleshooting-guide.html 8/8\n\n\n-----\n\n"
}