{
    "0": "## Automatic Tool Presetter (ATP) - Troubleshooting Guide\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/automatic-tool-presetter--atp----troubleshooting-guide.html 1/4\n\n\n-----\n\n",
    "1": "#### LAST UPDATED: 09/22/2023\n\n# Automatic Tool Presetter (ATP) - Troubleshooting Guide\n\n Introduction\n\n#### The Automatic Tool Presetter increases part accuracy and setup consistency. The system features the following:\n\n Automatic, manual, and tool-breakage- detection operations Conversational-style templates for easy tool-setting operations No macro programming required for operation Outputs G-code to MDI, where it may be edited, or transferred into a program Includes User-Definable Macros option Includes Haas Visual Part Programming System\n\n Machine Requirements:\n\n Non-compact ATP [1] Compact ATP [2]\n\n# Symptom Table\n\nSYMPTOM POSSIBLE CAUSE CORRECTIVE ACTION\n\nThe tool probe\n\nThe macros are\n\ndoes not Reload the macros\n\ncorrupted.\n\nbeep/activate.\n\nIncorrect The probe is not Calibrate the probe. See Calibration section below for more\nmeasurements. calibrated. information.\n\nCompact ATP\n\nReplace the stronger dampener with weaker dampener 59\nbuilt before June The actuator's\n\n2164. See Dampener Replacement section below for more\n\n22, 2023 Only: The dampener is too\n\ninformation. Note: This does not apply to the ST-40 and ST-45\n\ntool probe deploys strong.\n\ncompact ATPs.\n\nand retracts slowly.\n\nCheck for tools or parts in machining area that block motion of\n\nAlarm 808\n\nThe probe arm failed probe arm. Check for sufficient air pressure and volume. Check\n\nAUTOMATIC PROBE\n\nto extend or retract. probe arm mechanism for broken parts, damaged air lines, or\n\nARM FAULT\n\nbroken electrical connections.\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/automatic-tool-presetter--atp----troubleshooting-guide.html 2/4\n\n|mptom Table|Col2|Col3|\n|---|---|---|\n|SYMPTOM|POSSIBLE CAUSE|CORRECTIVE ACTION|\n|The tool probe does not beep/activate.|The macros are corrupted.|Reload the macros|\n|Incorrect measurements.|The probe is not calibrated.|Calibrate the probe. See Calibration section below for more information.|\n|Compact ATP built before June 22, 2023 Only: The tool probe deploys and retracts slowly.|The actuator's dampener is too strong.|Replace the stronger dampener with weaker dampener 59- 2164. See Dampener Replacement section below for more information. Note: This does not apply to the ST-40 and ST-45 compact ATPs.|\n|Alarm 808 AUTOMATIC PROBE ARM FAULT|The probe arm failed to extend or retract.|Check for tools or parts in machining area that block motion of probe arm. Check for sufficient air pressure and volume. Check probe arm mechanism for broken parts, damaged air lines, or broken electrical connections.|\n\n\n![](photo/Automatic Tool Presetter (ATP) - Troubleshooting Guide.pdf/Automatic-Tool-Presetter-(ATP)---Troubleshooting-Guide.pdf-1-0.png)\n\n-----\n\n",
    "2": "|Alarm 809 PROBE ARM SWITCH FAULT|The switch signals indicated both switches simultaneously or one of the switches indicates an unexpected position.|Check the switches and trip flags for damage and the switch wiring for damage.|\n|---|---|---|\n|Alarm 9159 SPINDLE MOTION REQUESTED WHILE PROBE ARM EXTENDED|The probe arm is extended.|Retract the probe arm. If the probe arm is retracted, troubleshoot the probe arm position switches.|\n|Alarm 9974 PARTS CATCHER WILL COLLIDE WITH PROBE ARM|The probe arm is extended.|Retract the probe arm. If the probe arm is retracted, troubleshoot the probe arm position switches.|\n|Alarm 9976 PROBE ARM WILL COLLIDE WITH PARTS CATCHER|The parts catcher is extended.|Retract the parts catcher. If the parts catcher is retracted, troubleshoot the parts catcher position switches.|\n|Macro Alarm 1081 ILLEGAL TOOL OFFSET NUMBER T|Tool offset ‘T0' is not allowed.|If using the ‘T’ input on the cycle call line check the value is not zero (0), otherwise this alarm may occur if no tool or tool offset was selected in the MDI mode before running the cycle. Caution: Make sure the turret is safely away from the probe stylus before indexing the turret.|\n|Macro Alarm 1082 ILLEGAL TOOL NOSE VECTOR H|Only vector numbers 1 to 8 are allowed.|Check and correct the ‘H’ input if used, or the ‘T’ address on the tool offset page.|\n|Macro Alarm 1083 INPUTS C H1 – H4 MIXED|Can not use a cutter using the ‘C’ input with a corner vector H1–H4 specified.|Edit the program to not set a cutter using the ‘C’ input with a corner vector H1–H4 specified.|\n|Macro Alarm 1091 FORMAT ERROR|An input has been omitted from the command line or when two inputs have been mixed.|Edit the program and restart from the beginning. Refer to the macro programming section of the Renishaw Manual for the relevant inputs required.|\n|Macro Alarm 1092 PROBE OPEN|The stylus is in contact with the surface before the skip move begins.|Return to reference and edit the part program. If the stylus remains in an open (triggered) condition during any part of the cycle, the PROBE OPEN alarm is raised. Check that the stylus is not in contact with the surface or check to see whether vibration is causing it to unseat during a move. The alarm may also be raised at the start of a macro if the probe system is in error (a probe open signal condition is forced by the Renishaw interface). Check to make sure that the probe system is switched on in time before a skip move begins. A program dwell may be required. Check that the status LED on the interface is changing state when the stylus is deflected. If this does not happen, contact the supplier of the system for assistance.|\n|Macro Alarm 1093 PROBE FAIL|The expected surface is not contacted within the overtravel ofthe probe.|Check the program and edit where necessary. Check that the probe stylus has been calibrated on the machine. Check that the status LED on the interface is changing state when the stylus is deflected. If this does not happen, contact the supplier of the system for assistance.|\n|Macro Alarm 1099 PROBE FAIL|The tool length error exceeds the programmed Mm tolerance.|The programmed value must be half the total tolerance.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/automatic-tool-presetter--atp----troubleshooting-guide.html 3/4\n\n\n-----\n\n",
    "3": "# Calibration\n\n#### Corrective Action:\n\n The ATP needs to be calibrated anytime a stylus has been replaced or if the CNC control generates alarms during probe routines. Follow the ATP CALIBRATION procedure for calibrating the ATP.\n\n# Dampener Replacement\n\n\n#### Remove the (x3) screws around the back ATP cover [1] .\n\n###  NOTE: To make ATP cover removal easier,\n\n#### use a strong magnet to remove the cover.\n\n On the inside of the ATP cover [1], remove the screws securing the dampener disk [2].\n\n Install new dampener disk [2] on the ATP cover [1].\n\n Install the ATP cover [1] back on the ATP base by mating the dampener [2] with the actuator shaft first.\n\n Deploy and retract the ATP to make sure it works.\n\n\n![](photo/Automatic Tool Presetter (ATP) - Troubleshooting Guide.pdf/Automatic-Tool-Presetter-(ATP)---Troubleshooting-Guide.pdf-3-0.png)\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/automatic-tool-presetter--atp----troubleshooting-guide.html 4/4\n\n\n-----\n\n"
}