{
    "0": "### 13 - HRP - Troubleshooting\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 1/20\n\n\n-----\n\n",
    "1": "|Col1|13.1 HRP - TROUBLESHOOTING|Col3|\n|---|---|---|\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 2/20\n\n\n-----\n\n",
    "2": "|ALARM / SYMPTOM|POSSIBLE CAUSE|CORRECTIVE ACTION|\n|---|---|---|\n|9147 Robot Protocol Version Mismatch|Connecting to a robot that has been power cycled may cause a Version Mismatch. This causes all robot functions to be locked until the alarm is cleared.|Release the E-Stop and press RESET to clear the alarm. Then press the E- Stop and press F1 to connect the robot|\n|9155 ROBOT EXCEEDED MAX PAYLOAD|Robot attempted to clamp a part which would result in exceeding the max payload allowed.|Reduce part weight. See layout drawings for the payload specifications for each robot size.|\n|9156 ROBOT COMMAND FAILED, No subcode or other robot alarms.|Robot software was downgraded after a Robot Software Update. Example: Original Robot Software version 1.22 and downdgraded to version 1.15.|See HRP - Initialized Start section below.|\n|9157 ROBOT SOFTWARE UPDATE FAILED|Robot Update was unsuccessful.|You must update robot software again before you can use the robot. See the Robot Software Update procedure for more information.|\n|9158 ROBOT COMMUNICATIONS LOST|Communication with the robot has been lost.|The Robot Control MUST be power cycled. Press RESET on the machine and Power Cycle the Robot Control.|\n|9160 ROBOT EMERGENCY STOP|The Robot Emergency Stop button was pressed either from the robot control box or the remote pendant. Or robot estop chain is broken.|Please release the Robot Emergency Stop button(s) and press reset to proceed. Verify all robot estops are released. Verify estop wiring (including external estop inputs) to robot are intact and correctly wired.|\n|Robot motion stops and System Message & Notification 20021. 32 Robot SYST-032 ENBL signal from UOP is lost.|The FANUC control disconnected from Haas Control.|See the HRP Disconnect Alarms section below to increase the Modbus TCP Timeout & Disable DHCP.|\n|Robot motion stops and System Message & Notification 20021. 34 Robot SYST-034 HOLD signal from SOP/UOP is lost.|The FANUC control disconnected from Haas Control.|See the HRP Disconnect Alarms section below to increase the Modbus TCP Timeout & Disable DHCP.|\n|Robot motion stops and System Message & Notification 20021.224 Robot HOST-224 DHCP: No response from server.|The FANUC control disconnected from Haas Control.|See the HRP Disconnect Alarms section below to increase the Modbus TCP Timeout & Disable DHCP.|\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 3/20\n\n\n-----\n\n",
    "3": "|The Robot won't Connect to the CNC|The wiring from the interface to the Haas Control is not correct.|Make sure you have connected the terminal connectors on TB-1B in the correct order. Refer to the Robot Installation Procedure, Electrical section.|\n|---|---|---|\n||The robot is not unlocked and activated.|The first time connecting a robot to a machine, a Robot Activation window will pop-up. This pop-up shows the Software Version of the machine, the MAC address of the robot, and the Machine Generated Code used for Machine Time Extension on the portal. Note: Go to the Robot MAC Address section to find the MAC address using a laptop.|\n||The CNC software is outdated.|Make sure the software is 100.20.000.1200 or higher. Refer to the Robot Installation Procedure machine requirements section.|\n||The Robot IP address and the CNC are mismatched.|If the Robot Software is 1.11 or lower. Upgrade the Robot control to 1.15 or higher. Contact your HFO for more information. See Robot IP Address section for more info.|\n||The arm moved during power off.|Connect & Calibrate Haas Robot using the video below.|\n||The RJ45 to USB adapter is defective.|Make sure the USB cable is connected to the correct USB port on the main processor. Make sure that the user USB port works by plugging a USB device and determine if the USB device gets detected, if it does not get detected follow the USB Troubleshooting Guide and troubleshoot the USB Ports. If all the above check out correct, then unplug the RJ45 from the adaptor and connect it to the RJ45 on a laptop and make sure you are able to connect to the robot via the IPedant. If you are able to connect to the robot via the laptop then the RJ-45 to USB adapter is defective.|\n|Robot does not jog in a straight line, It makes an arcing motion when moving in Cartesian along a single axis.|The robot joints were not lined up to the correct location when the Mastering or Quick Mastering procedure was set.|Move all joints to zero and check to see if the lines on both sides of the joint are lined up. Line the marking up on all axis and redo the Master/Quick Master procedure.|\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 4/20\n\n\n-----\n\n",
    "4": "|Robot does not jog. When trying to jog, a yellow warning message appears saying \"Please activate Light Curtain or Cell Safe\".|The safety parameter has not been applied.|Re-upload the configuration files from HBC to receive the safety parameter.|\n|---|---|---|\n|The following errors appear when trying to connect to the iPendant from a PC: \"Disconnected From Controller\" \"iPendant has never been connected\"|The robot may need to be reinitialized.|Do the following steps: 1. Make a backup by following this procedure: How to Make an Image Backup 2. Reinitialize the robot by following this procedure: How to Reinitialize Robot|\n|E-Stop alarm wont clear.|Jumper might be missing from JP1 on the SIO PCB.|Verify the jumper is installed on the SIO PCB at JP1. If it is not installed, reinstall it.|\n|Machine needs to be Manually Recovered or goes into Robot APL Recovery.|The Robot cycle was interrupted or the machine/robot was in a unsafe condition and needs to be recovered.|See the Haas Robot - APL Recovery section in HRP Operation for more information.|\n|Machine goes into Robot APL Recovery between two scheduled jobs.|Machine motion was active when next job was started.|Add a machine dwell to the Post Run sequence in the first job. The dwell needs to be long enough to give the robot enough time to finish dropping off the part and moving to ready position. Start at around 15-20 seconds and adjusting up or down from there. The dwell is long enough if the second job is able to start and the machine does not go into Robot APL Recovery.|\n|Alarm 391 Feature Disabled is generated commanding M180 & M181|The single switch auto window that comes from the HRP or APL can not be commanded independently.|Feature must be commanded by the robot or APL.. The customer needs to purchase an auto window install kit to get stand-alone functionality. Refer to AD documents that apply to your machine model. AD0652 - DT/DM/UMC-350 - Auto Window - Installation AD0663 - UMC 500 - 1500 Auto Window - Installation AD0669 - VMC Small - Auto Window - Installation|\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-4-0.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 5/20\n\n\n-----\n\n",
    "5": "|When activating the HRP through HBC you get a warning saying, RobotDetails \"macAddress\" field cannot be empty.|The MAC Address needs to be updated in the system.|Take a photo of the Haas robot serial number plate and Fanuc F Number plate. Attach the photos to the work order and contact Haas Service to have the system updated. See HBC Registration - Missing MAC Address section below.|\n|---|---|---|\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 6/20\n\n\n-----\n\n",
    "6": "|ALARM / SYMPTOM|POSSIBLE CAUSE|CORRECTIVE ACTION|\n|---|---|---|\n|9156.004 SRVO-004 Fence Open 9156.037 SRVO-037 IMSTP input (Group:1) 9156.406 SRVO-406 DCS SSO SVOFF input 1,1|The TB1-B and TB3B Connectors are plugged into the wrong location or unplugged.|Plug the connectors into the correct location. See the SRVO-004 Fence Open section below.|\n|9156.050 Robot Command Failure SRVO-050 Collision Detect Alarm|Jogging the robot in setup mode and the center of rotation of J6 is in line with the center of rotation of J4. Then rotating W or P, will cause J4 axis to attempt to rotate at a very fast speed. This singularity point is called the wrist singularity.|Press RESET to clear the alarm. Do not jog the robot through this singularity point.|\n||The robot motion file does not have enough points producing a non-smooth motion.|Add more points to the motion file smoothing out the robot motion.|\n|9156.406 SRVO-406 DCS SSO SVOFF input 1,1|The K9 and K10 Relays on I/O PCB are not installed.|Make sure you have the K9 and K10 relays installed on the I/O PCB. Refer to the Robot Installation Procedure, Electrical section.|\n||The fence is open in Run Mode.|Make sure the interlock is working and that machine is receiving the interlock input signal.|\n||The TB3-B wiring is damaged or miswired.|Check the wiring for the TB3-B connector. Compare the wiring of the connector to the wiring diagram.|\n||The DCS Cartesian Position Check Zone was not setup.|Follow the DCS Cartesian Position Check Zone procedure.|\n|9156.037 SRVO-037 IMSTP input (Group:1)|The TB3-B wiring is damaged or miswired.|Check the wiring for the TB-3B connector. Compare the wiring of the connector to the wiring diagram.|\n|9156.062 ROBOT COMMAND FAILED SRVO-062 BZAL alarm|The batteries in the robot arm have died.|Follow the HRP - Battery Replacement procedure to replace the batteries and follow the HRP - Quick Mastering procedure to remaster the robot.|\n|9156.115 SRVO-115 Limit Error (Motion Group Number, Axis Number)|The linear path passes outside of the axis limit.|Re-Teach program points or use a Joint position to record the axis in a position that is in the middle of its travel limits.|\n|9156.378 FANUC ROBOT ALARM - SFDI12 Status abnormal or 9156.378 FANUC ROBOT ALARM - SFDI22 Status abnormal|The K9 and K10 Relays on I/O PCB are not installed.|Make sure you have the K9 and K10 relays installed on the I/O PCB. Refer to the Robot Installation Procedure, Electrical section.|\n||A chain alarm was detected with the SFDI signal.|If a chain error is detected, correct the cause of the alarm then see the Reset Chain Error Section below.|\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 7/20\n\n\n-----\n\n",
    "7": "|9156.230 FANUC ROBOT ALARM - Chain 1 abnormal a,b or 9156.231 FANUC ROBOT ALARM - Chain 2 abnormal a,b|Damaged or miswired TBOP20 wires or connector. A mismatch occurred between duplicate safety signals. SRVO-230 is issued if such a mismatch that a contact connected on the chain 1 side (between EAS1 and EAS11 is closed, and a contact on the chain 2 side (between EAS2 and EAS21 is open occurs. SRVO-231 is issued if such a mismatch that a contact on the chain 1 side is open, and a contact on the chain 2 side is closed occurs.|Check that the signal cables for the fence is not damaged or miswired. TBOP20 connector and cables in the Fanuc Control Box or the Interface Box M12 connector Robot Signals. See SRVO- 230/231/266/267 FENCE1/2 status abnormal section below. After the cause of the alarm is corrected then see the Reset Chain Error Section below.|\n|---|---|---|\n|9156.217 SRVO-217 E-STOP Board not found or 9156.037 SRVO-037 IMSTP input (Group:1) 9156.406 SRVO-406 DCS SSO SVOFF input 1,1 9156.217 SRVO-217 E-STOP Board not found|This alarm is generated when either the E-Stop PCB or Safety I/O PCB is missing from the Safety buss.|Check that the Safety I/O PCB is fully seated. Check the cable is connected to the E-Stop PCB & Safety I/O PCB.|\n|9156.219 SRVO-219 Safety I/O brd fuse%d blown %s|Failed to successfully execute a robot command. A fuse on the additional Safe I/O board has blown. The TB1-B or TB3-B wiring is damaged, miswired, or plugged into the wrong location.|The number of the safe I/O device that the alarm occurs is displayed in the end the message such as (1). The safe I/O device number is displayed in DCS Safe I/O device menu. Correct the wiring issue. Replace the fuse on the additional Safe I/O board or the additional Safe I/O board. See the Fuse Replacement Section below.|\n|9156.266 SRVO-266 FENCE1 status abnormal|Damaged or miswired TBOP20 wires or connector. A mismatch occurred between duplicate safety signals. SRVO-266 is issued if such a mismatch that a contact connected on the chain 1 side (between EAS1 and EAS11 is closed, and a contact on the chain 2 side (between EAS2 and EAS21 is open occurs. SRVO-266 is issued if such a mismatch that a contact on the chain 1 side is open, and a contact on the chain 2 side is closed occurs.|Check that the signal cables for the fence is not damaged or miswired. TBOP20 connector and cables in the Fanuc Control Box or the Interface Box M12 connector Robot Signals. See SRVO- 230/231/266/267 FENCE1/2 status abnormal section below. After the cause of the alarm is corrected then see the Reset Chain Error Section below.|\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 8/20\n\n\n-----\n\n",
    "8": "|9156.267 SRVO-267 FENCE2 status abnormal|Damaged or miswired TBOP20 wires or connector. A mismatch occurred between duplicate safety signals. SRVO-266 is issued if such a mismatch that a contact connected on the chain 1 side (between EAS1 and EAS11 is closed, and a contact on the chain 2 side (between EAS2 and EAS21 is open occurs. SRVO-266 is issued if such a mismatch that a contact on the chain 1 side is open, and a contact on the chain 2 side is closed occurs.|Check that the signal cables for the fence is not damaged or miswired. TBOP20 connector and cables in the Fanuc Control Box or the Interface Box M12 connector Robot Signals. See SRVO- 230/231/266/267 FENCE1/2 status abnormal section below. After the cause of the alarm is corrected then see the Reset Chain Error Section below.|\n|---|---|---|\n|9156.289 SRVO-289 Smooth Stop|The DCS Zone was not setup correctly. Cartesian Speed Check, Joint Position Check, or Joint Speed Check is Enabled when it should be Disabled.|See Disable DCS Speed Check section below for steps to disable.|\n|9156.490 PRIO-490 Modbus TCP Server Error|Interference or faulty RJ-45 Ethernet cable.|Depending on the Robot build date the cables were not built with ferrite filters installed. Install ferrite filters PN: 64-1252 to both RJ-45 Communication cables at the electrical interface box and to the USB to Ethernet Adapter at the Main Processor PCB. See the Ferrrite Filter section below. If the alarm continues, test the cables refer to Network Cable Tester Tool procedure. If the cable passes the network cable test, see the HRP Discconect Alarms section below to increase the Modbus TCP Timeout & Disable DHCP.|\n|9156.043 Robot Command Failed|The mode switch on the Fanuc Controller Operator Panel is incorrectly set to teaching mode when there is no teaching pendant connected.|Flip the mode switch on to Auto mode.|\n\n\n## Fanuc Robot Alarms\n\nThese alarms are generated when the robot is at fault state. A sub-alarm number indicates\nfaults ID and is provided by FANUC robot.\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 9/20\n\n\n-----\n\n",
    "9": "|ALARM / SYMPTOM|POSSIBLE CAUSE|CORRECTIVE ACTION|\n|---|---|---|\n|9150.219 SRVO-219 Safety I/O brd fuse%d blown %s|Failed to successfully execute a robot command. A fuse on the additional Safe I/O board has blown. The TB1-B TB3-B wiring is damaged, miswired, or plugged into the wrong location.|The number of the safe I/O device that the alarm occurs is displayed in the end the message such as (1). The safe I/O device number is displayed in DCS Safe I/O device menu. Correct the wiring issue. Replace the fuse on the additional Safe I/O board or the additional Safe I/O board. See the Fuse Replacement Section below.|\n|9150.289 SRVO-289 Smooth Stop|The DCS Zone was not setup correctly. Cartesian Speed Check, Joint Position Check, or Joint Speed Check is Enabled when it should be Disabled.|See Disable DCS Speed Check section below for steps to disable.|\n|9150.378 FANUC ROBOT ALARM - SFDI12 Status abnormal or 9150.378 FANUC ROBOT ALARM - SFDI22 Status abnormal|The K9 and K10 Relays on I/O PCB are not installed.|Make sure you have the K9 and K10 relays installed on the I/O PCB. Refer to the Robot Installation Procedure, Electrical section.|\n|9150.402 FANUC ROBOT ALARM - SRVO-402 DCS Cart. position limit|This alarm is generated when the robot has a DCS Cartesian Position Check Zone setup with a speed limit and the robot is jogged outside the work zone above the speed limit.|Lower the feed rate and jog back into the DCS Cartesian Position Check Zone. Verify the work zone is setup correctly by checking the 4D DCS Display.|\n|9150.403 SRVO-403 DCS Cart. speed limit, 9150.404 SRVO-404 DCS Joint pos. limit, or 9150.405 SRVO-405 DCS Joint speed limit|The DCS Zone was not setup correctly. Cartesian Speed Check, Joint Position Check, or Joint Speed Check is Enabled when it should be Disabled.|See Disable DCS Speed Check section below for steps to disable.|\n|9150.488 FANUC ROBOT ALARM - SRVO-488 DCS CPC Speed Limit|This alarm is generated when the robot has a DCS Cartesian Position Check Zone setup with a speed limit and the robot is jogged outside the work zone above the speed limit.|Lower the feed rate and jog back into the DCS Cartesian Position Check Zone. Verify the work zone is setup correctly by checking the 4D DCS Display.|\n|9152.x Robot Hit Joint Limit or robot does not jog|Jogging the robot in setup mode and the center of rotation of J6 is in line with the center of rotation of J4. Then rotating W or P, will cause J4 axis to attempt to rotate at a very fast speed, traveling past the travel limit. This singularity point is called the wrist singularity. The Joint Position will be greater than the Robot Joint Travel Limit. The Sub-Code of the alarm represents the joint number.|Connect to the robot using the Remote Pendant through the web interface. Clear the alarm and jog the robot joint away from the travel limit. Reconnect to the Haas control.|\n\n\n## Haas Robot - Active Alarms\n\n\nMore than one Fanuc alarm may be\npresent if the machine generates an\nalarm. Navigate to the Active Alarms tab\nto view all active Fanuc alarms.\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-9-0.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 10/20\n\n\n-----\n\n",
    "10": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-10-0.png)\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-10-1.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 11/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-10-0.png)\n\n-----\n\n",
    "11": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-11-0.png)\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-11-1.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 12/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-11-0.png)\n\n-----\n\n",
    "12": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-12-0.png)\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-12-1.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 13/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-12-0.png)\n\n-----\n\n",
    "13": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-13-0.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 14/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-13-0.png)\n\n-----\n\n",
    "14": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-14-0.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 15/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-14-0.png)\n\n-----\n\n",
    "15": "###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 16/20\n\n\n-----\n\n",
    "16": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-16-0.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 17/20\n\n\n-----\n\n",
    "17": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-17-0.png)\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-17-1.png)\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-17-2.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 18/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-17-0.png)\n\n-----\n\n",
    "18": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-18-0.png)\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-18-1.png)\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 19/20\n\n\n![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-18-0.png)\n\n-----\n\n",
    "19": "![](photo/HRP - Troubleshooting - Haas Service Manual.pdf/HRP---Troubleshooting---Haas-Service-Manual.pdf-19-0.png)\n\n###### Feedback\n\n\n###### https://www.haascnc.com/service/online-manuals/haas-robot-package-1/troubleshooting.html 20/20\n\n\n-----\n\n"
}