{
    "0": "## I/O PCB - Troubleshooting Guide - NGC\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 1/17\n\n\n-----\n\n",
    "1": "##### LAST UPDATED: 03/21/2023\n\n\n# I/O PCB - Troubleshooting Guide - NGC\n\n Introduction\n\n###  Download and fill out the NGC I/O PCB Inspection Report Checklist below before replacing any\n##### parts.\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 2/17\n\n\n-----\n\n",
    "2": "#### NGC I/O PCB INSPECTION REPORT CHECKLIST\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-2-0.png)\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-2-1.png)\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 3/17\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-2-0.png)\n\n-----\n\n",
    "3": "![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-3-0.png)\n\n# PCB serial number\n\n Electrical Safety\n\n\n### Note: The PCB's serial number must\n\n##### be included in the inspection report checklist. The serial number is on a sticker [1] on the top of the inspection checklist.\n\n The serial number will start with two letters, followed by eight digits. Include both the letters and numbers on the inspection report.\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-3-0.png)\n\n###  Caution: When you do maintenance or repair on CNC machines and their components, you must always\n\n##### follow basic safety precautions. This decreases the risk of injury and mechanical damage.\n\n Set the main circuit breaker to the [OFF] position.\n\n###  Danger: Before beginning any work inside the control cabinet the High Voltage indicator light on the 320V\n\n##### Power Supply / Vector Drive must have been off for at least 5 minutes.\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 4/17\n\n\n-----\n\n",
    "4": "##### Some service procedures can be dangerous or life-threatening. DO NOT attempt a procedure that you do not fully understand. If you have any doubts about doing a procedure contact your Haas Factory Outlet (HFO) and schedule a service visit.\n\n# Symptom Table\n\nSymptom / Alarm Possible Cause Corrective Action\n\nAlarm 9924 CONTROL AND IO\nBOARD COMMUNICATION\nLOST\nAlarm 9925 CONTROL AND IO The I/O PCB built-in Low Volt Power Troubleshoot the I/O PCB LVPS.\nBOARD COMMUNICATION Supply (LVPS) voltages are not present Refer to the I/O PCB Low Volt\nDID NOT INITIALIAZE. or the LVPS is not working. Power Supply section below.\nAlarm 9915 IO BOARD\nCONFIGURATION CRC\nMISMATCH\n\n1. Press [POWER OFF].\n2. Put the USB memory\n\ndevice into the control.\n##### Note: The USB memory device must contain your Haas Control Key and the correct configuration files.\n\n3. Press [POWER ON].\n4. Press [DIAGNOSTIC].\n5. Go to I/O Config [2] in\n\nthe Diagnostics tab [1].\n6. Press [F3] to Update\n\nAlarm 9100 NON RESETTABLE Config Table [4].\nSOFTWARE ERROR at Power Main CRC and Factory CRC do not match 7. Press [RESET] to continue.\nOn, or Alarm 9915 IO BOARD due to the I/O PCB being swapped out. If the alarm does not clear,\nCONFIGURATION MISMATCH. cycle the machine power.\n\n##### The Main CRC and the Factory CRC[3] are now the same.\n\nAlarm 9933 SOFTWARE\n\nReload the I/O PCB main firmware\n\nVERSION MISMATCH and 9100 The firmware update failed, or I/O\n\n[refer to Next Generation Control -](https://www.haascnc.com/content/haascnc/en/service/troubleshooting-and-how-to/how-to/next-generation-control---i-o-pcb-main-firmware---update.html)\n\nNON RESETTABLE SOFTWARE firmware is corrupted.\n\n[I/O PCB Main Firmware - Update.](https://www.haascnc.com/content/haascnc/en/service/troubleshooting-and-how-to/how-to/next-generation-control---i-o-pcb-main-firmware---update.html)\n\nERROR\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 5/17\n\n|mptom Table|Col2|Col3|\n|---|---|---|\n|Symptom / Alarm|Possible Cause|Corrective Action|\n|Alarm 9924 CONTROL AND IO BOARD COMMUNICATION LOST Alarm 9925 CONTROL AND IO BOARD COMMUNICATION DID NOT INITIALIAZE. Alarm 9915 IO BOARD CONFIGURATION CRC MISMATCH|The I/O PCB built-in Low Volt Power Supply (LVPS) voltages are not present or the LVPS is not working.|Troubleshoot the I/O PCB LVPS. Refer to the I/O PCB Low Volt Power Supply section below.|\n|Alarm 9100 NON RESETTABLE SOFTWARE ERROR at Power On, or Alarm 9915 IO BOARD CONFIGURATION MISMATCH.|Main CRC and Factory CRC do not match due to the I/O PCB being swapped out.|1. Press [POWER OFF]. 2. Put the USB memory device into the control. Note: The USB memory device must contain your Haas Control Key and the correct configuration files. 3. Press [POWER ON]. 4. Press [DIAGNOSTIC]. 5. Go to I/O Config [2] in the Diagnostics tab [1]. 6. Press [F3] to Update Config Table [4]. 7. Press [RESET] to continue. If the alarm does not clear, cycle the machine power. The Main CRC and the Factory CRC[3] are now the same.|\n|Alarm 9933 SOFTWARE VERSION MISMATCH and 9100 NON RESETTABLE SOFTWARE ERROR|The firmware update failed, or I/O firmware is corrupted.|Reload the I/O PCB main firmware refer to Next Generation Control - I/O PCB Main Firmware - Update.|\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-4-0.png)\n\n-----\n\n",
    "5": "|Alarm 9899 IOPCB CAN FAULT and/ or 9105 IO BOARD COMMAND EXECUTION FAILURE. See the CAN Bus Systems Troubleshooting Guide for more information.|The CAN node I/O Configuration is incorrect.|Update the I/O configuration via the I/O Config tab.|\n|---|---|---|\n||The incorrect CAN node is enabled.|Verify that Factory Settings 9000.001 -> 9031.001 are set correctly. Only active nodes should be enabled.|\n||The Autodoor CAN PCB does not have power.|Verify that the Low Volt Power supply is supplying power to the CAN Autodoor PCB.|\n||The CAN node Communication cable is disconnected.|Power down machine for at least a minute. Verify all CAN communication cables are connected correctly.|\n||The CAN Module ID Selector is incorrect.|Power down machine for at least a minute. Set ID selector correctly. Power up machine.|\n||The CAN Modules have incorrect termination.|Power down machine for at least a minute. Verify that only last node in the chain is terminated. Power up machine.|\n||The CAN Node needs to be reset.|Disable CAN Node via 9000.001 -> 9031.001. If the machine recovers (I/O page isn’t “X”) after disabling a particular node, try to enable the node again.|\n|Spindle load pegs to 200%|There is a problem with the 120 VAC outputs circuit components (solenoids, Wye-Delta, Oil Pump etc.)|Inspect the wiring, pins, and connectors for this circuit. Inspect the I/O board for faults. Replace the I/O if necessary|\n|Machine generates multiple Alarm 20014.1 SIO TOOL CHANGER PCB IS NOT PRESENT and 20014.0 SIO TOOL CHANGER PCB PRESENT after the I/O TC PCB is installed.|The I/O or TC PCB firmware is outdated.|Update I/O Main and TC firmware version to the latest. Refer to Next Generation Control - I/O PCB Main Firmware - Update.|\n|Machines equipped with I/O PCB P/N: 34-3490A/B with an auxiliary estop that generates an estop alarm after the closing of machine doors.|The doors closing have shaken the estop and caused a momentarily disconnect and caused an estop of the machine.|A debounce capacitor will need to be added to the I/O PCB. Refer to the E-Stop - Debounce procedure.|\n|Main I/O Firmware fails to load.|TC PCB is causing the failure.|Remove the TC PCB from the Main I/O PCB. Then try the Firmware upgrade again.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 6/17\n\n\n-----\n\n",
    "6": "|Alarm 2001 EMERGENCY STOP SWITCH ERROR|There is a loose connection from the Hydraulic Union Safety Device adaptor to the I/O PCB. Only applies to these machines built after 12/20/2023: ST - 10/15/20/25/28/30/35/L/Y/LY REBOOT ONLY: ST-40/40Y/45/45Y (note: For ST-45/45L/45Y machines equipped with optional workholding)|Check the cable connected to the I/O PCB at P12, make sure the cable is not damaged or has a loose connection.|\n|---|---|---|\n\n\n# Serial I/O PCB Alarms\n\n##### Depending on the machine software version, I/O PCB main firmware version you will get a different alarm, see table below:\n\n ALARM# / TITLE ALARM# / TITLE\n\n SOFTWARE SOFTWARE 100.17.000.2021 AND 100.17.000.2030 AND LOWER HIGHER ALARM TROUBLESHOOTING\n\n I/O PCB MAIN I/O PCB (34-348XC) MAIN FIRMWARE 02.04 AND FIRMWARE 02.05 AND LOWER HIGHER\n\nAttempts were made to download an I/O\n\n9830-IOPCB MEMORY DATA\n\nconfiguration file while configuration memory\n\nLOCKED\n\nwas locked.\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 7/17\n\n|ALARM# / TITLE SOFTWARE 100.17.000.2021 AND LOWER I/O PCB MAIN FIRMWARE 02.04 AND LOWER|ALARM# / TITLE SOFTWARE 100.17.000.2030 AND HIGHER I/O PCB (34-348XC) MAIN FIRMWARE 02.05 AND HIGHER|ALARM TROUBLESHOOTING|\n|---|---|---|\n||9830-IOPCB MEMORY DATA LOCKED|Attempts were made to download an I/O configuration file while configuration memory was locked.|\n\n\n-----\n\n",
    "7": "|850-INTERNAL I/O ERROR|9800-INTERNAL I/O ERROR- SHIFT CHAIN|An internal I/O circuit board error has been sensed in it's shift chain. - Press the [RESET] button. Power off, and inspect the circuit components on the I/O PCB, see section below.|\n|---|---|---|\n||9801-INTERNAL I/O ERROR-TC COMMUNICATION|An internal I/O circuit board error has been sensed where the main and tool changer microcontrollers could not communicate. - Press the [RESET] button. Inspect the tool changer relays, make sure the relay sockets are solder into the PCB board. Do not replace the I/O PCB. For IO PCB (34-348xA): · Upgrade the I/O PCB Tool Changer firmware to the latest 01.xx version. For IO PCB (34-348xC): · Update the I/O PCB Main firmware to the latest 02.xx version. · Update the I/O PCB Tool Changer firmware to the latest 01.xx version. For IO PCB (34-349x): · Update the I/O PCB Main firmware to the latest 03.xx version. Refer to Next Generation Control - I/O PCB Main Firmware - Update procedure.|\n|9900-IOPCB COMMUNICATION LOST|9802-SIO MCU COMMUNICATION LOSS|Communication has been lost to the I/O PCB. Check that the I/O PCB has power by looking for the 12/24V green LED's. Look for a tripped circuit breaker. If the board has power, then|\n|||1. Check the RJ-45 cable connection from Maincon PCB (J14) to I/O PCB (J4). To test the cable refer to Network Cable Tester Tool procedure.|\n|||2. Check the 3-Phase power input from PSUP (P4) to I/O PCB (P55).|\n|||3. Inspect the RJ-45 connector on the Maincon PCB & I/O PCB for bent pins.|\n|||Upgrade the software to 100.17.000.2045 or higher. If you get this alarm with version 100.17.000.2045 or higher download an error report and e-mail to Haas service.|\n||9831-I/O # ERROR|The main processor has command an output that is not configured in the I/O configuration file.|\n||9832-SIO COMMUNICATION ERROR|The I/O PCB has received partial or invalid communication from the main processor.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 8/17\n\n\n-----\n\n",
    "8": "|Col1|9833-PCB OVER TEMPERATURE|The I/O PCB is reporting a temperature that exceeds limits (65 degrees C)|\n|---|---|---|\n||9834-12V FAULT|The 12V supply on the I/O PCB is outside of its limits of 10 to 14V.|\n|175-GROUND FAULT DETECTED|9803-120VAC GROUND FAULT|A 120 VAC ground fault condition was detected by the I/O PCB. The ground fault signal gets generated by the PSUP PCB. The ground fault signal gets sent to I/O PCB at P56 for monitoring. Check all 120V outputs for possible shorts to earth ground. See ground fault troubleshooting section below.|\n||9804-240VAC GROUND FAULT|A 240 VAC ground fault condition was detected by the I/O PCB. The ground fault signal gets generated by the PSUP PCB. The ground fault signal gets sent to I/O PCB at P56 for monitoring. Check all 240 V outputs for possible shorts to earth ground. This includes short circuits in any amplifier or vector drive output as well as any 240V pumps or chip conveyor. See ground fault troubleshooting section below.|\n|9903-120 VAC SHORT CIRCUIT|9805-120VAC PHASE C SHORT CIRCUIT|A short circuit was detected in the 120V outputs from the I/O PCB. Check all 120V outputs for possible shorts to earth ground. See ground fault troubleshooting section below.|\n||9835-120VAC PHASE C OVER CURRENT|A partial short circuit was detected in the 120V outputs from the I/O PCB. Check all 120V outputs for possible shorts to earth ground. See ground fault troubleshooting section below.|\n||9836-120VAC PHASE C NO CURRENT|An output was turned on but no change in current was detected. Check for broken wires/cables.|\n||9837-CALIBRATION ERROR|I/O PCB Calibration error. Either calibration did not occur during power up. Or the new calibration values don't match the previous values.|\n||9838-TSC FAN FAILURE|The fan for the TSC heat sink stopped; could cause TSC over heating later on.|\n||9820-TSC HEAT SINK OVER TEMP|The TSC Heat sink temperature is over the limit of 85°C. Check for a damaged fan.|\n|9904-PCOOL MALFUNCTION|9806-PCOOL SHORT CIRCUIT|The programmable coolant circuit has detected a short circuit (>2.5A) and has shut down. Press the [RESET] button to clear alarms. If necessary, cycle power on the machine. Check for a shorted cable.|\n||9807-PCOOL GROUND FAULT|The programmable coolant circuit has detected a ground fault condition and has shut down. Press the [RESET] button to clear alarms. If necessary, cycle power on the machine. Check for a shorted cable to earth ground.|\n||9808-PCOOL OVERHEAT|The programmable coolant circuit has overheated and shut down. Give time for it to cool, then press the [RESET] button to clear alarms. Check for obstructions to Pcool movement.|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 9/17\n\n\n-----\n\n",
    "9": "|Col1|9839-PCOOL STALLED|A high current (2.5A> I >1A) was detected in the programmable coolant circuit. Check for obstructions to Pcool movement. Check for binding in the Pcool unit.|\n|---|---|---|\n||9840-PCOOL OVERLOAD|The programmable coolant circuit has detected an overload condition. Check for binding in the Pcool unit.|\n||9841-PCOOL MOTOR DISCONNECTED|The programmable coolant circuit was commanded on but no current was detected. Check to see if the Pcool will turn when commanded. Check for broken wires. If the machine is equipped with 34-3090B I/O PCB make sure the Main I/O firmware has version 3.18 or higher. Refer to Next Generation Control - I/O PCB Main Firmware - Update procedure.|\n|9905-IOPCB TOOL CHANGER FAULT|9809-TOOL CHANGER BUS SHORT CIRCUIT|The I/O PCB experienced an internal short circuit. Replace the 4 tool changer relays. If problem persists, then replace the I/O PCB.|\n||9810-INTERNAL I/O ERROR-TC TRANSISTOR FAILURE|The I/O PCB tool changer (or bar feeder) transistor appears to be damaged. Replace the I/O PCB.|\n||9811-TOOL CHANGER CABLE SHORT CIRCUIT|One of the tool changer outputs has detected a short circuit. Check all tool changer motor outputs for possible short circuits.|\n||9812-TOOL CHANGER GROUND FAULT|A ground fault condition was detected by the I/O PCB tool changer. Check all tool changer motor outputs for possible short circuits to earth ground.|\n||9813-TOOL CHANGER REGEN SHORTED|The I/O PCB experienced a short circuit on the tool changer regen circuit. Check for a short circuit on it's external regen resistor at P57.|\n||9814-CAROUSEL BRAKE RESISTOR OVER TEMPERATURE|TBD|\n||9815-ARM BRAKE RESISTOR OVER TEMPERATURE|TBD|\n||9816-REGEN OVERLOAD|TBD|\n||9817-MULTIPLE MOTOR COMMANDS|TBD|\n||9818-TOOL CHANGER OVERLOAD|TBD|\n||9842-OVER VOLTAGE|TBD|\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 10/17\n\n\n-----\n\n",
    "10": "|Col1|9822 - IOPCB VERTICAL BRAKE FAILURE|NGC machines equipped with I/O PCB P/N: 34- 3490A/B and a servo brake motor may generate alarm 9822 IOPCB Brake. Upgrade the Main I/O PCB firmware to 3.06 or higher. Refer to I/O PCB Firmware - Update - NGC procedure.|\n|---|---|---|\n|||Upgrade the Main I/O PCB Firmware to 4.21 or higher. HSG-A 07-11-2023|\n|880 - UNDER VOLTAGE ON 160V DC BUS|9843-TC UNDER VOLTAGE|The system detected an undervoltage condition from the TC circuit or the TC PCB. Check the 115 VAC input to the TC PCB, check for shorts on the tool changer motors. 1. Phase missing on the 120VAC power from the PSUP 2. Low voltage level in the 120VAC power from the PSUP 3. Open diode (s) in the 120Vac bridge rectifier circuit either in the I/O PCB (34- 348x A, 34-348x C PCBs) or the TC PCB 34-5502 used on 34-349X I/O PCBs 4. Faulty TC PCB 34-5502 PCB 5. Faulty I/O PCB|\n||9844-REGEN OPEN|TBD|\n||9845-CONFIGURATION CONFLICT|TBD|\n||9846-MOTOR STALLED|TBD|\n||9847-MOTOR DISCONNECTED|The control software and the I/O firmware are not compatible, or the I/O firmware is outdated.|\n|9906-CHIP CONVEYOR MALFUNCTION|9819-CHIP CONVEYOR SHORT CIRCUIT|TBD|\n||9848-CHIP CONVEYOR MOTOR DISCONNECTED|TBD|\n\n\n# IO PCB LE7 Light\n\n##### LE7 [1] is one of the lights that come on when the machine is powered up. LE7 has three states that it can be used to troubleshoot potential issues:\n\n LE7 is OFF\n\n 1. This indicates the IO PCB is not\n receiving power or the software isn't functioning correctly. Check the breakers and make sure the IO board\n\n### Note: The image above shows the location\n\n##### is receiving proper power.\n for LE7 on IO board 34-349C. The position of LE7 can differ based on the version of IO PCB\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 11/17\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-10-0.png)\n\n-----\n\n",
    "11": "##### on the machine. LE7 is Blinking - This can mean several things:\n\n 1. This indicates that the board is not\n communicating the IO states at the regular rate. It is normal for this to happen when the machine is booting up and also during firmware upgrades. 2. Check the serial communication cable\n going to the Maincon. 3. LE7 will also be blinking if there is an\n internal IO PCB alarm (9800 Internal error/shift). 4. Since LE7 blinks when booting up, if\n the control screen won't turn on and LE7 is blinking this may indicate that the Maincon is stuck in it's boot process. This doesn't mean that there is an issue with the IO board, but can indicate the state of the machine.\n\n LE7 is On Solid\n\n 1. This is the normal state of LE7 when\n the machine is powered on and booted up. It indicates the IO is communicating with the Maincon.\n\n\n# Lathe I/O PCB Hydraulic Union Safety Device Connection\n\n\n##### 1. Push [POWER OFF]. Go to P12 on the\n I/O PCB, unplug the Hydraulic Union Safety Device adaptor. 2. Plug the cable back into P12 making\n sure its fully seated in the port. Push\n [POWER ON]. Push [ALARMS]. Push\n [RESET]. 3. Verify that the EMERGENCY STOP\n alarm has cleared.\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-11-0.png)\n\n# Ground Fault Circuit Monitor\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 12/17\n\n\n-----\n\n",
    "12": "##### On the NGC control there is a ground fault circuit monitor. This circuit monitors the 115V and 230V for a ground fault condition.\n\n 1. For 175 GROUND FAULT alarm.\n Determine if the alarm is caused by a 115 or 230 VAC component. 2. Press the [DIAGNOSTIC] button,\n cursor to the I/O tab. 3. Type in: \"Ground\", then press [F1]. 4. Look at the\n _120VAC/_240VAC_GROUND FAULT analog value. The circuit with the highest value is the one that reported the ground fault. 5. Test the components that operate in\n\n that voltage range, for a short-circuit (see the table below). 6. The ground fault analog value will drop\n when the component with the short circuit is disconnected from the machine control.\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-12-0.png)\n\n##### Components to Check when a Ground Fault Alarm Occurs\n\n\n### \n\n\n##### Note: *These devices can be disconnected from the I/O PCB without an alarm being generated.\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 13/17\n\n\n-----\n\n",
    "13": "|MACHINE COMPONENTS|I/O PCB LOCATION|OPERATING VOLTAGE|\n|---|---|---|\n|4th and 5th Axis Brake Solenoids*|P16 - P17|120 VAC|\n|Worklights*|P18 - P21|120 VAC|\n|High Intensity Lights*|P22|120 VAC|\n|GFI|P23|120 VAC|\n|Door Interlocks*|P40, P41, P42|120 VAC|\n|Lube Panel Solenoids|P35, P36|120 VAC|\n|Y/D Contactor Coil|P37, P38|120 VAC|\n|DC Tool Change Motors*|P58|160 VDC, generated from the 120 VAC|\n|Spindle Motor Fan / Oil Pump|P32|120 VAC|\n|Sub Spindle Fan / Hydraulic Pump Fan|P33|120 VAC|\n|TSC/HPC Pump*|P31|240 VAC|\n|Coolant Pump*|P29|240 VAC|\n|Chip Auger / Conveyor*|P24, Quad PCB|240 VAC|\n|Axis Motors||240 VAC|\n|Spindle Motor||240 VAC|\n|Hydraulic Pump Motor||240 VAC|\n\n\n# I/O PCB Low Volt Power Supply\n\n##### The I/O PCB is equipped with a built in Low Volt Power Supply (LVPS). This power supply generates 3 DC voltages: +24V, +15V and +12V [1].\n\n These voltages are used to power low volt circuits on the I/O PCB and also to power external devices like Probes, Axis Brakes, and User Inputs.\n\n There are 3 LEDs that show the presence of these voltages on the I/O PCB.\n\n When the I/O LVPS is working correctly these LED's will glow solid.  When there is a short circuit on the low volt circuits these LED's can begin to flash on and off.\n When this happens you will need to find the source of the short circuit, start by disconnecting devices that are\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 14/17\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-13-0.png)\n\n-----\n\n",
    "14": "# PCB Component Inspection\n\n##### Intermittent alarms or symptoms can be caused by component failure. Below is a list of possible failures:\n\n 1. Missing solder on all or some\n components pins 2. Poor solder 3. Solder bridges 4. Wrong component installation\n (orientation) 5. Missing components\n\n###  Note: Some PCB's have unused\n\n##### circuits and are missing components intentionally, look for broken off components.\n\n 6. Broken components 7. Broken pins on IC's 8. Bent pins on the connectors\n\n Use a magnifying glass to inspect the circuit components on the front and back of the I/O PCB. Below are the circuit component zones to inspect:\n\n 1. 24 VDC, 160 VDC circuit components\n (DC motor tool changers, axis brake, probe). 2. 120 VAC outputs circuit components\n (solenoids, Wye-Delta, Oil Pump etc.) 3. 240 VAC outputs circuit components\n (Coolant, TSC, Auger). 4. Check the RJ45 connector for loose\n housing and bent pins.\n\n###  Important: If you find a damaged\n\n##### component, replace the I/O PCB, inspect the new I/O PCB circuit components before installing.\n\n# Electrical Diagrams\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 15/17\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-14-0.png)\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-14-1.png)\n\n-----\n\n",
    "15": "![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-15-0.png)\n\n##### I/O PCB Interconnect Diagram\n\n I/O PCB (P39) to Mill - Spindle Head Inputs Detail Diagram\n\n I/O PCB (P34, P35) to Mill - Air/Lube Panel Detail Diagram\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 16/17\n\n\n![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-15-0.png)\n\n-----\n\n",
    "16": "![](photo/I_O PCB - Troubleshooting Guide - NGC.pdf/I_O-PCB---Troubleshooting-Guide---NGC.pdf-16-0.png)\n\n##### PSUP (P17) to I/O PCB (P56) Detail Diagram\n\n# Related Content\n\n\n#### CAN I/O SYSTEMS\n\n\n#### ROBOT INTEGRATION\n\n\n#### DIAGNOSTIC DATA\n\n\nhttps://www.haascnc.com/service/troubleshooting-and-how-to/troubleshooting/next-generation-control---i-o-pcb---troubleshooting-guide.html 17/17\n\n\n-----\n\n"
}