{
    "0": "# HPU Inspection Report\n\nLathe HPU Clear Work holding\n\nNo Alarm #\n\nNo\n\n4. Other - Describe the issue:\n\n**Mandatory Troubleshooting**\n\n5. Is the oil tank full? Check with the dipstick, sight glass, or clear container. Only check while the HPU is off, the pressure\n\nrain hose (if applicable) slope down the entire way to the tank?\n\nn on for some time and then turned off does the gauge return to zero?\n\n**HPU Must Be On**\n\n**Sheet Metal Likely Needs to Be Removed**\n\n27. Have you tried cleaning solenoid valves per Haas HPU troubleshooting guide (for any hydraulic functions not working)?\n\n28. Have you checked to see that all electrical connection to solenoids, HPU, fans (if applicable) and sensors are secure?\n\n**Notes/Observations:**\n\n**this report, an error report, and any relevent documentation to a service notification in the Haas Service App.**\n\n**Answer these questions in the notes section**\n\n## hine was doing when the problem for the service call occurred?\n\n Page 1 of 1\n\n|Technician|Col2|Col3|Col4|Col5|Col6|Col7|Cell#|Col9|Col10|Col11|Col12|Col13|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|\n|Serial Number|||||||Date||||||\n|Model|||||||||||||\n||||||||||||||\n|Type of HPU||Older style||Lathe HPU||Clear Work holding|||EC indexer||Bosch||\n\n|1. What alarm generated?|Col2|Yes|Col4|No Alarm #|\n|---|---|---|---|---|\n|2. When does the alarm/sympton occur?|||||\n|3. Is the Alarm resettable?||Yes||No|\n|4. Other - Describe the issue:|||||\n||||||\n\n|Mandatory Troubleshooting|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n|5. Is the oil tank full? Check with the dipstick, sight glass, or clear container. Only check while the HPU is off, the pressure gage reads zero, and the oil has had time to fully drain to the holding tank.|Yes No||||\n|6. Is there any oil in needle gauge (yellow fluid vs clear glycerin that should be present)?||Yes||No|\n|7. Does the hydraulic union drain hose (if applicable) slope down the entire way to the tank?||Yes||No|\n|8. Have you checked all fittings to ensure they are tight?||Yes||No|\n|9. Does the oil look clean?||Yes||No|\n|10. Is coolant present in the oil?||Yes||No|\n|11. Are there bubbles in the oil in the tank?||Yes||No|\n|12. Is the HPU phasing indicator light in the control cabinet green?||Yes||No|\n|13. What is the oil temperature on gauge page when issues occurs?||Yes||No|\n|14. Is there a low oil warning icon on control?||Yes||No|\n|15. After the machine has been on for some time and then turned off does the gauge return to zero?||Yes||No|\n|HPU Must Be On|||||\n|16. Is the pump noisy? If yes explain in notes.||Yes||No|\n|17. What is the chuck pressure (if applicable)?||Yes||No Pressure|\n|18. What is the tailstock pressure (if applicable)?||Yes||No Pressure|\n|19. What is the steady rest pressure (if applicable)?||Yes||No Pressure|\n|20. What is the sub spindle pressure (if applicable)?||Yes||No Pressure|\n|21. Do all hydraulic functions work when commanded? List the ones that do not work in the notes section.||Yes||No|\n|22. Are the HPU cooling fans (if applicable) running?||Yes||No|\n|23. Do the needle gauges read similar to gauge page?||Yes||No|\n|24. Is the pump running, but not creating pressure?||Yes||No|\n|25. Does the hydraulic pressure fluctuate wildly?||Yes||No|\n|Sheet Metal Likely Needs to Be Removed|||||\n|26. Is the pump intake screen clogged?||Yes||No|\n|27. Have you tried cleaning solenoid valves per Haas HPU troubleshooting guide (for any hydraulic functions not working)?||Yes||No|\n|28. Have you checked to see that all electrical connection to solenoids, HPU, fans (if applicable) and sensors are secure?||Yes||No|\n|29. What is the voltage at the solenoid coils?||Yes||No|\n|Notes/Observations:|||||\n||||||\n|Attach this report, an error report, and any relevent documentation to a service notification in the Haas Service App.|||||\n|Answer these questions in the notes section|||||\n|Did you indicate which functions do not respond when commanded in the notes section?|||||\n|Did you explain what the machine was doing when the problem for the service call occurred?|||||\n\n\n-----\n\n"
}